---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetDamperName(System.Int32)
source: html/e84d23a2-0615-50a1-2802-746f74a51818.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetDamperName Method

Gets the damper name from its identifier.

## Syntax (C#)
```csharp
public string GetDamperName(
	int damperId
)
```

## Parameters
- **damperId** (`System.Int32`) - The damper identifier.

## Returns
The damper name.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - The damper does not exist.